; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	image1 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star2 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
)
(:goal (and
	(have_image Phenomenon6 image1)
	(have_image Planet7 thermograph0)
	(have_image Planet8 image1)
	(have_image Star9 image1)
	(have_image Star10 image1)
	(have_image Phenomenon11 thermograph0)
	(have_image Planet12 thermograph0)
	(have_image Phenomenon13 image1)
	(have_image Planet14 image1)
	(have_image Phenomenon15 image1)
	(have_image Star16 thermograph0)
	(have_image Phenomenon17 thermograph0)
	(have_image Star18 thermograph0)
	(have_image Planet19 image1)
))

)

; plan
1. (turn_to satellite0 groundstation5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 14
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 14
3. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 14
4. (turn_to satellite0 phenomenon17 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon17)
   goals met: 0 of 14
5. (take_image satellite0 phenomenon17 instrument1 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 1 of 14
6. (turn_to satellite0 phenomenon15 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 14
7. (take_image satellite0 phenomenon15 instrument1 image1)
   added: (have_image phenomenon15 image1)
   goals met: 2 of 14
8. (turn_to satellite0 phenomenon13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 14
9. (take_image satellite0 phenomenon13 instrument1 image1)
   added: (have_image phenomenon13 image1)
   goals met: 3 of 14
10. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 14
11. (take_image satellite0 phenomenon11 instrument1 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 4 of 14
12. (turn_to satellite0 phenomenon6 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 14
13. (take_image satellite0 phenomenon6 instrument1 image1)
   added: (have_image phenomenon6 image1)
   goals met: 5 of 14
14. (turn_to satellite0 planet12 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet12)
   goals met: 5 of 14
15. (take_image satellite0 planet12 instrument1 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 6 of 14
16. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 6 of 14
17. (take_image satellite0 planet14 instrument1 image1)
   added: (have_image planet14 image1)
   goals met: 7 of 14
18. (turn_to satellite0 planet19 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet19)
   goals met: 7 of 14
19. (take_image satellite0 planet19 instrument1 image1)
   added: (have_image planet19 image1)
   goals met: 8 of 14
20. (turn_to satellite0 planet7 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet7)
   goals met: 8 of 14
21. (take_image satellite0 planet7 instrument1 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 9 of 14
22. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 9 of 14
23. (take_image satellite0 planet8 instrument1 image1)
   added: (have_image planet8 image1)
   goals met: 10 of 14
24. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 10 of 14
25. (take_image satellite0 star10 instrument1 image1)
   added: (have_image star10 image1)
   goals met: 11 of 14
26. (turn_to satellite0 star16 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star16)
   goals met: 11 of 14
27. (take_image satellite0 star16 instrument1 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 12 of 14
28. (turn_to satellite0 star18 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star18)
   goals met: 12 of 14
29. (take_image satellite0 star18 instrument1 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 13 of 14
30. (turn_to satellite0 star9 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star9)
   goals met: 13 of 14
31. (take_image satellite0 star9 instrument1 image1)
   added: (have_image star9 image1)
   goals met: 14 of 14
